<?php
// +-----------------------------------------------------------------------+
// | Piwigo - a PHP based photo gallery                                    |
// +-----------------------------------------------------------------------+
// | Copyright(C) 2008-2012 Piwigo Team                  http://piwigo.org |
// | Copyright(C) 2003-2008 PhpWebGallery Team    http://phpwebgallery.net |
// | Copyright(C) 2002-2003 Pierrick LE GALL   http://le-gall.net/pierrick |
// +-----------------------------------------------------------------------+
// | This program is free software; you can redistribute it and/or modify  |
// | it under the terms of the GNU General Public License as published by  |
// | the Free Software Foundation                                          |
// |                                                                       |
// | This program is distributed in the hope that it will be useful, but   |
// | WITHOUT ANY WARRANTY; without even the implied warranty of            |
// | MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU      |
// | General Public License for more details.                              |
// |                                                                       |
// | You should have received a copy of the GNU General Public License     |
// | along with this program; if not, write to the Free Software           |
// | Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, |
// | USA.                                                                  |
// +-----------------------------------------------------------------------+
$lang['PH_AutoPrune_false'] = 'Απενεργοποίηση (προεπιλογή)';
$lang['PH_AutoPrune_title_d'] = 'Εάν ενεργοποιήσετε την αυτόματη περικοπή, θα ενεργοποιείται αυτόματα για κάθε σύνδεση χρηστών στην γκαλερί (συμπεριλαμβανομένου του διαχειριστή ή του webmaster) και με βάση τις ρυθμίσεις προστασίας.<br><br>
<b style=&quot;color: red;&quot;> Χρησιμοποιήστε με προσοχή! Τα δεδομέναπου περικόπτονται δεν είναι ανακτήσιμα!</b>';
$lang['PH_AutoPrune_title'] = 'Αυτόματη Περικοπή';
$lang['PH_AutoPrune_true'] = 'Ενεργοποίηση';
$lang['PH_AutoRange_title_d'] = 'Παρακαλούμε να ρυθμίσετε τα κριτήρια για την <b>προστασία</b> του Ιστορικού σας για την αυτόματη περικοπή. Αρκετές επιλογές είναι δυνατές:<br><br>
- Κρατήστε για x ημέρες<br>
- Κρατήστε για x μήνες<br>
- Κρατήστε για x έτη<br><br>
Για παράδειγμα: Εάν θέλετε να διατηρήσετε ένα ιστορικό βάθος 3 μηνών,μπορείτε να ρυθμίσετε για τρεις μήνες ή 91 ημέρες.<br><br>
Σημείωση: Η σύνοψη ιστορικού δεν επηρεάζεται από την αυτόματη περικοπή.';
$lang['PH_AutoRange_title'] = 'κρατήστε το ιστορικό μέχρι το:';
$lang['PH_Bad_version_backup'] = 'Λάθος έκδοση του πρόσθετου! Το αντίγραφο ασφαλείας που προσπαθείτε να επαναφέρετε είναι ξεπερασμένες ή έχει δημιουργηθεί με παλαιότερη έκδοση του πρόσθετου.';
$lang['PH_Dump_Download'] = 'Για να κατεβάσετε το αρχείο αντιγράφου ασφαλείας, επιλέξτε αυτό το πλαίσιο:';
$lang['PH_Dump_NOK'] = 'Η δημιουργία αντιγράφων ασφαλείας απέτυχε!';
$lang['PH_Dump_OK'] = 'Η δημιουργία αντιγράφων ασφαλείας ήταν επιτυχής!';
$lang['PH_ManualPrune_title_d'] = 'Αυτό το χαρακτηριστικό σας επιτρέπει να διαγράψετε καταχωρήσεις στο ιστορικό βάσει μιας σειράς από ημερομηνίες. Επιλέξτε μια ημερομηνία έναρξης και ημερομηνία λήξης της επεξεργασίας και εκτελέσετε.<br><br>
<b style=&quot;color: red;&quot;>Προειδοποίηση: Τα δεδομένα στο ιστορικό θα διαγραφτούν ανεπανόρθωτα!</b> Μπορείτε να κάνετε αντίγραφα ασφαλείας και επαναφορά πίνακων ιστορικού χρησιμοποιώντας τις λειτουργίες στο δεξί πλαίσιο..<br><br>
Σημείωση: Η σύνοψη ιστορικού δεν επηρεάζεται από την περικοπή.';
$lang['PH_ManualPrune_title'] = 'Χειροκίνητη Περικοπή';
$lang['PH_No_Backup_File'] = 'Δεν βρέθηκε αρχείο αντιγράφου ασφαλείας για την αποκατάσταση!';
$lang['PH_Prune_Done'] = 'Χειροκίνητη περικοπή έγινε!';
$lang['PH_Prune_Error'] = 'Σφάλμα χειροκίνητης περικοπής! Ελέγξτε το εύρος των ημερομηνιών σας.';
$lang['PH_Prune'] = 'Εκτέλεση χειροκίνητης περικοπής';
$lang['PH_Restoration_NOK'] = 'Η Αποκατάσταση απέτυχε!';
$lang['PH_Restoration_OK'] = 'Η Αποκατάσταση ήταν επιτυχής!';
$lang['PH_Restore_File'] = 'Επαναφορά ιστορικού';
$lang['PH_Restore'] = 'Για να επαναφέρετε ένα αντίγραφο ασφαλείας του πίνακα ιστορικού σας.<br>Μόνο το αποθηκευμένο αρχείο στο διακομιστή θα λαμβάνεται υπόψη.';
$lang['PH_Save_Title_d'] = 'Επειδή η περικοπή είναι οριστική και αμετάκλητη, είναι σκόπιμο να αποθηκεύσετε τον πίνακα ιστορικού σας πριν να αρχίσετε την περικοπή. Από προεπιλογή, ο πίνακας αποθηκεύεται σε ένα αρχείο στον server και μπορεί να αποκατασταθεί από εκεί.<br><br>Αλλά υπάρχει και η δυνατότητα να κατεβάσετε το αρχείο αντιγράφου ασφαλείας για να το κρατήσετε έξω από την γκαλερί σας. Στην περίπτωση αυτή, η αποκατάσταση πρέπει να γίνεται μέσω εργαλείου διαχείρισης της βάσης δεδομένων σας (Συνήθως το phpMyAdmin).';
$lang['PH_Save_Title'] = 'Ασφάλεια αντιγράφων ασφαλείας';
$lang['PH_Save'] = 'Δημιουργία αντιγράφων ασφαλείας ιστορικού';
$lang['PH_Support'] = 'Η επίσημη υποστήριξη σχετικά με αυτό το πρόσθετο είναι μόνο σ\' αυτό το φόρουμ του Piwigo:<br>
<a href="http://piwigo.org/forum/viewtopic.php?id=19418" onclick="window.open(this.href);return false;">English forum - http://piwigo.org/forum/viewtopic.php?id=19418</a>';
$lang['PH_save_config'] = 'Οι ρυθμίσεις αποθηκεύτηκαν!';
$lang['PH_submit'] = 'Αποθήκευση ρυθμίσεων';
$lang['Start_Date'] = 'Ημερομηνία έναρξης';
$lang['range']['1'] = 'Ημέρα(ες)';
$lang['range']['2'] = 'Μήνας(ες)';
$lang['range']['3'] = 'Χρόνος(ια)';
?>