<?php
// +-----------------------------------------------------------------------+
// | This file is part of Piwigo.                                          |
// |                                                                       |
// | For copyright and license information, please view the COPYING.txt    |
// | file that was distributed with this source code.                      |
// +-----------------------------------------------------------------------+
$lang['PH_AutoPrune_false'] = 'השבת (ברירת מחדל)';
$lang['PH_AutoPrune_title'] = 'גיזום אוטומטי';
$lang['PH_AutoPrune_title_d'] = 'אם תפעיל גיזום אוטומטי, הוא יופעל באופן אוטומטי בכל פעם שהמשתמש נכנס לגלריה (כולל מנהל או מנהל רשת) ובהתאם להגדרות השמירה.<br><br><b style=&quot;color: red;&quot;>השתמש בזהירות! נתונים שנגזרו לא יהיו משוחזרים!</b>';
$lang['PH_AutoPrune_true'] = 'הפעל';
$lang['PH_AutoRange_title'] = 'שמור על ההיסטוריה עד:';
$lang['PH_AutoRange_title_d'] = 'אנא הגדר את קריטריון שמירת ההיסטוריה שלך עבור גיזום אוטומטי. כמה בחירות אפשריות:<br><br>- שמור x ימים<br>- שמור x חודשים<br>- שמור x שנים<br><br>לדוגמה: אם ברצונך לשמור עומק היסטורי של 3 חודשים, תוכל להגדיר שלושה חודשים או 91 ימים.<br><br> הערה: סיכום ההיסטוריה לא מושפע מהגיזום האוטומטי.';
$lang['PH_Bad_version_backup'] = 'גרסת התוסף שגויה! הגיבוי שאתה מנסה לשחזר מיושן או נוצר עם גרסה ישנה יותר של התוסף.';
$lang['PH_Dump_Download'] = 'כדי להוריד את קובץ הגיבוי, סמן את תיבה זו:';
$lang['PH_Dump_NOK'] = 'הגיבוי נכשל!';
$lang['PH_Dump_OK'] = 'הגיבוי הצליח!';
$lang['PH_ManualPrune_title'] = 'גיזום ידני';
$lang['PH_ManualPrune_title_d'] = 'תכונה זו מאפשרת לך למחוק רשומות היסטוריה בהתבסס על טווח תאריכים. בחר תאריך התחלה ותאריך סיום טיפול והפעל.<br><br><b style=&quot;color: red;&quot;>אזהרה: נתוני ההיסטוריה יימחקו לצמיתות!</b> תוכל לגבות ולשחזר טבלת ההיסטוריה באמצעות הפונקציות במסגרת הימנית.<br><br> הערה: סיכום ההיסטוריה לא מושפע מהגיזום.';
$lang['PH_No_Backup_File'] = 'לא נמצא קובץ גיבוי לשחזור!';
$lang['PH_Prune'] = 'הפעל גיזום ידני';
$lang['PH_Prune_Done'] = 'גיזום ידני הושלם!';
$lang['PH_Prune_Error'] = 'שגיאת גיזום ידני! בדוק את טווח התאריכים שלך.';
$lang['PH_Restoration_NOK'] = 'השחזור נכשל!';
$lang['PH_Restoration_OK'] = 'השחזור הצליח!';
$lang['PH_Restore'] = 'כדי לשחזר גיבוי של טבלת ההיסטוריה שלך.<br>רק הקובץ שנשמר בשרת נלקח בחשבון.';
$lang['PH_Restore_File'] = 'שחזר היסטוריה';
$lang['PH_Save'] = 'גבה היסטוריה';
$lang['PH_Save_Title'] = 'גיבוי בטיחות';
$lang['PH_Save_Title_d'] = 'מאחר שהגיזום הוא סופי ולא הפיך, מומלץ לשמור על טבלת ההיסטוריה שלך לפני התחלת הגיזום. כברירת מחדל, הטבלה נשמרת בקובץ בשרת וניתן לשחזר אותה משם.<br><br> אך גם ניתן להוריד את קובץ הגיבוי כדי לשמור אותו מחוץ לגלרייתך. במקרה זה, השחזור חייב להתבצע דרך כלי ניהול מסד הנתונים שלך (בדרך כלל phpMyAdmin).';
$lang['PH_Support'] = 'התמיכה הרשמית בתוסף זה נמצאת רק בנושאי הפורום הבאים של Piwigo:<br><a href="http://piwigo.org/forum/viewtopic.php?id=19418" onclick="window.open(this.href);return false;">פורום באנגלית - http://piwigo.org/forum/viewtopic.php?id=19418</a>';
$lang['PH_save_config'] = 'הגדרות נשמרו!';
$lang['PH_submit'] = 'שמור הגדרות';
$lang['Start_Date'] = 'תאריך התחלה';
$lang['range']['1'] = 'יום(ים)';
$lang['range']['2'] = 'חודש(ים)';
$lang['range']['3'] = 'שנה(ות)';